#include "stdio.h"
/*
1. Стандартные потоки
Определить класс с именем TRAIN, содержащий следующие поля:
● название пункта назначения;
● номер поезда;
● время отправления.
Определить методы доступа к этим полям и перегруженные операции
извлечения и вставки для объектов типа TRAIN.
Заранее число объектов не известно.
Написать программу, выполняющую следующие действия:
● записи должны быть упорядочены по времени отправления поезда;
● вывод на экран информации о поездах, направляющихся в пункт,
название которого введено с клавиатуры;
● если таких поездов нет, выдать на дисплей соответствующее
сообщение.
*/


int main()
{


	return 0;
}